export const projects = [
    {
        name: '大學專題-居家安全辨識警示系統',
        description: '使用了Python 程式語言並且導入AI深度學習影像辨識模組例如:Yolo、DeepFace來搭建安全辨識系統，當有異常發生時，能即時透過Line BOT送出警報，而後端的歷史紀錄是透過MSSQL建置資料庫並且使用Python Flask 以MVC的架構搭建網頁讓使用者可以查看或是操作。在整個過程中遇上了不少困難，其中像是模組的問題，導致開發困難，或是組員因為對系統的架構理解有誤，導致工作有所延誤。幸虧透過我與組員和指導老師一次次討論、教學，最後在專題發表會裡或得評審老師的好評。這對我來說是非常有意義的經驗，透過這次的專題設計過程，也讓我學習到團隊合作跟溝通的重要性。',
        link: 'https://github.com/1246ashit/firebaseForPython',
    },
    {
        name: '實習 北捷採購網開發助理',
        description: '這個專案裡面，使用了C# .NET 、jQuery跟Ajax來開發。我要配合其他工程師前輩開發的功能，把這些小功能組合成比較完整的功能項目(子功能)。在這過程中，因為程式碼大部分是既有的，因此我需要閱讀大量前期留下的程式碼，一開始閱讀專業人士的程式碼，很多地方在理解跟概念上不是很熟，導致當時工作有很大的挑戰；幸好，當時的主管對我耐心的教導，我才能順利地將子功能推出，在此次經驗裡我學到專業人士他們對於程式架構的想法，還有設計流程，藉由這次的經驗，我對於程式設計的安排有更進一步的認知。'
    },
    {
        name: '工讀助理  資安設定自動化腳本撰寫',
        description:'在這次專案中，要使用 bash script 自動化處理 Linux 資安條例。腳本能夠自動配置並優化資安設定，使其符合標準，過程中，我還學會建立虛擬化環境來測試腳本是否能正常運行。這次經驗讓我對 bash script跟虛擬化 有了初步了解，對於未來的專案將會更有信心和能力去應對。'
    }
];